Repository: Microsoft/slow-cheetah
Catalog: src/Microsoft.VisualStudio.SlowCheetah.VS/MultilingualResources/Microsoft.VisualStudio.SlowCheetah.VS.*.xlf
Languages: es, ko, pt_br, ru

source: SlowCheetah - XML config transforms
es: SlowCheetah: transformaciones de configuración XML
ko: SlowCheetah - XML 구성 변환
pt_br: SlowCheetah – transformações de configuração de XML
ru: SlowCheetah — преобразования XML-конфигурации

source: This package enables you to transform your app.config or any other XML file based on the build configuration. It also adds additional tooling to help you create XML transforms.
es: Este paquete le permite transformar su archivo app.config o cualquier otro archivo XML según la configuración de compilación. Además, agrega herramientas adicionales para ayudarle a crear transformaciones de XML.
ko: 이 패키지를 사용하면 app.config 또는 다른 XML 파일을 빌드 구성에 따라 변환할 수 있습니다. 또한 XML 변환을 만드는 데 도움이 되는 추가 도구도 제공합니다.
pt_br: Este pacote permite que você transforme seu app.config ou qualquer outro arquivo XML com base na configuração de build. Ele também adiciona ferramentas extras para ajudar você a criar transformações XML.
ru: Этот пакет позволяет преобразовать ваш файл app.config или любой другой XML-файл на основе конфигурации сборки. Он также добавляет дополнительные инструменты для создания XML-преобразований.

# EnablePreviewCheckbox.AutoSize
source: True
es: Verdadero
ko: 맞음
pt_br: Verdadeiro
ru: Верно.

# EnablePreviewCheckbox.Text
source: Show diff on transformation preview
es: Mostrar diferencias en la vista previa de transformación
ko: 변환 미리 보기에 차이점 표시
pt_br: Exibir comparação na visualização de transformação
ru: Показать несовпадения при предварительном просмотре преобразования

# GeneralGroupBox.AutoSize
source: True
es: Verdadero
ko: 맞음
pt_br: Verdadeiro
ru: Верно.

# AddDepentUponCheckbox.AutoSize
source: True
es: Verdadero
ko: 맞음
pt_br: Verdadeiro
ru: Верно.

# AddDepentUponCheckbox.Text
source: Add DepentUpon metadata to transform files
es: Agregar metadatos DepentUpon a los archivos de transformación
ko: 변환 파일에 DepentUpon 메타데이터 추가
pt_br: Adicionar metadados DepentUpon para transformar arquivos
ru: Добавление метаданных DepentUpon для преобразования файлов

# GeneralGroupBox.Dock
source: Top
es: Arriba
ko: 위쪽
pt_br: Topo
ru: Верх

# GeneralGroupBox.Text
source: General Settings
es: Configuración general
ko: 일반 설정
pt_br: Configurações Gerais
ru: Общие параметры

# $this.AutoSize
source: True
es: Verdadero
ko: 맞음
pt_br: Verdadeiro
ru: Верно.

# $this.Localizable
source: True
es: Verdadero
ko: 맞음
pt_br: Verdadeiro
ru: Верно.

# Error_CantFindPreviewTool
source: Cannot find the preview tool {0}. Verify the transform settings in Tools\Options.
es: No se puede encontrar la herramienta de vista previa {0}. Compruebe la configuración de transformación en Herramientas/Opciones.
ko: 미리 보기 도구 {0}을(를) 찾을 수 없습니다. [도구\옵션]에서 변환 설정을 확인하세요.
pt_br: Não foi possível encontrar a ferramenta de visualização {0}. Verifique as configurações de transformação em Ferramentas/Opções.
ru: Не удается найти средство предварительного просмотра {0}. Проверьте параметры преобразования в разделе "Сервис" или "Параметры".

# Error_NoPreviewToolSpecified
source: No preview tool specified. You can set a preview tool in the transform settings in Tools\Options.
es: No se ha especificado ninguna herramienta de vista previa. Puede establecer una herramienta de vista previa en la configuración de transformación en Herramientas\Opciones.
ko: 미리 보기 도구를 지정하지 않았습니다. [도구\옵션]의 변환 설정에서 미리 보기 도구를 설정할 수 있습니다.
pt_br: Nenhuma ferramenta de visualização especificada. Você pode definir uma ferramenta de visualização nas configurações de transformação em Ferramentas/Opções.
ru: Не указано средство предварительного просмотра. Его можно задать в параметрах преобразования в разделе "Сервис" или "Параметры".

# Error_SavingProjectFile
source: Unable to save the project file {0}. {1}
es: No se puede guardar el archivo de proyecto {0}. {1}
ko: 프로젝트 파일 {0}을(를) 저장할 수 없습니다. {1}
pt_br: Não é possível salvar o arquivo de projeto {0}. {1}
ru: Не удалось сохранить файл проекта {0}. {1}.

# Error_SourceFileNotFound
source: The source file for the transform {0} was not found.
es: No se encontró el archivo de origen de la transformación {0}.
ko: {0} 변환에 대한 소스 파일 찾을 수 없습니다.
pt_br: O arquivo de origem da transformação {0} não foi encontrado.
ru: Исходный файл для преобразования {0} не найден.

# Error_TransformFileNotFound
source: The transform file {0} was not found.
es: No se encontró el archivo de transformación {0}.
ko: 변환 파일 {0}을(를) 찾을 수 없습니다.
pt_br: O arquivo de transformação {0} não foi encontrado.
ru: Файл преобразования {0} не найден.

# NugetInstall_ErrorOutput
source: Error installing SlowCheetah NuGet package to {0}.
es: Error al instalar el paquete NuGet de SlowCheetah en {0}.
ko: {0}에 SlowCheetah NuGet 패키지를 설치하는 중 오류가 발생했습니다.
pt_br: Erro ao instalar o pacote NuGet SlowCheetah em {0}.
ru: Ошибка при установке пакета NuGet SlowCheetah {0}.

# NugetInstall_FinishedOutput
source: Finished installing SlowCheetah NuGet package to {0}.
es: Finalizó la instalación del paquete NuGet de SlowCheetah en {0}.
ko: {0}에 SlowCheetah NuGet 패키지를 설치했습니다.
pt_br: Término da instalação do pacote NuGet SlowCheetah em {0}.
ru: Завершена установка пакета NuGet SlowCheetah {0}.

# NugetInstall_InstallingOutput
source: Installing SlowCheetah NuGet package to {0} ...
es: Instalando el paquete NuGet de SlowCheetah en {0} ...
ko: {0}에 SlowCheetah NuGet 패키지를 설치하는 중...
pt_br: Instalando o pacote NuGet SlowCheetah em {0}...
ru: Установка пакета NuGet SlowCheetah {0}...

# NugetInstall_Text
source: In order to execute transform on build, you will need the SlowCheetah NuGet package. Do you want to install the package now?
es: Para ejecutar transformaciones sobre la compilación, necesitará el paquete NuGet de SlowCheetah. ¿Desea instalarlo ahora?
ko: 빌드 시 변환을 실행하려면 SlowCheetah NuGet 패키지가 필요합니다. 지금 패키지를 설치하시겠습니까?
pt_br: Para executar a transformação no build, você precisará do pacote NuGet SlowCheetah. Deseja instalar o pacote agora?
ru: Чтобы выполнить преобразование сборки, вам понадобится пакет NuGet SlowCheetah. Установить его сейчас?

# NugetInstall_Title
source: Install SlowCheetah NuGet package
es: Instalar el paquete NuGet de SlowCheetah
ko: SlowCheetah NuGet 패키지 설치
pt_br: Instale o pacote NuGet SlowCheetah
ru: Установить пакет NuGet SlowCheetah

# NugetUpdate_InfoBarLink
source: here
es: aquí
ko: 여기
pt_br: aqui
ru: здесь

# NugetUpdate_InfoBarText
source: It seems that you do not have the correct version of the SlowCheetah Nuget package installed. Transforms on this project will not be executed. To learn about updating from an older version, click
es: Parece que no tiene instalada la versión correcta del paquete NuGet de SlowCheetah. No se ejecutarán transformaciones en este proyecto. Para obtener información acerca de la actualización desde una versión anterior, haga clic en
ko: SlowCheetah Nuget 패키지의 올바른 버전이 설치되어 있지 않은 것 같습니다. 이 프로젝트에서 변환이 실행되지 않습니다. 이전 버전에서 업데이트하는 방법을 알아보려면 다음을 클릭하세요.
pt_br: Parece que você não tem a versão correta do pacote Nuget SlowCheetah instalada. As transformações neste projeto não serão executadas. Para saber como atualizar de uma versão mais antiga, clique em
ru: Вероятно, у вас не установлена правильная версия пакета Nuget SlowCheetah. Преобразования в этом проекте не будет выполняться. Чтобы узнать больше об обновлении старой версии, щелкните

# NugetUpdate_Text
source: It seems that you have an older version of the SlowCheetah package installed. In order to avoid conflicts, you should update you package. Doing so may cause changes to your project file. Do you wish to update now?
es: Parece que tiene instalada una versión anterior del paquete de SlowCheetah. Para evitar conflictos, debe actualizarlo. Al hacerlo, se podrían producir cambios en el archivo de proyecto. ¿Desea actualizar ahora?
ko: SlowCheetah 패키지의 이전 버전이 설치되어 있는 것 같습니다. 충돌을 피하려면 패키지를 업데이트해야 하며 업데이트 시 프로젝트 파일이 변경될 수 있습니다. 지금 업데이트하시겠습니까?
pt_br: Parece que você tem uma versão mais antiga do pacote SlowCheetah instalada. Para evitar conflitos, você deve atualizar seu pacote. Isso pode causar alterações em seu arquivo de projeto. Deseja atualizar agora?
ru: Вероятно, у вас установлена старая версия пакета Nuget SlowCheetah. Чтобы избежать конфликтов, следует обновить пакет. Это может вызвать изменения в файле проекта. Обновить пакет сейчас?

# NugetUpdate_Title
source: Update SlowCheetah NuGet package
es: Actualizar el paquete NuGet de SlowCheetah
ko: SlowCheetah NuGet 패키지 업데이트
pt_br: Atualizar o pacote NuGet SlowCheetah
ru: Обновление пакета Nuget SlowCheetah

# NugetUpdate_WaitText
source: Updating the SlowCheetah NuGet package, this may take a few seconds
es: Actualizando el paquete NuGet de SlowCheetah; esta operación puede tardar unos segundos
ko: SlowCheetah NuGet 패키지를 업데이트하는 중이며 몇 초 정도 소요될 수 있습니다.
pt_br: Atualizando o pacote NuGet SlowCheetah, isto pode levar alguns segundos
ru: Идет обновление пакета Nuget SlowCheetah; это может занять несколько секунд.

# NugetUpdate_WaitTitle
source: SlowCheetah Update
es: Actualización de SlowCheetah
ko: SlowCheetah 업데이트
pt_br: Atualização do SlowCheetah
ru: Обновление SlowCheetah

# TransformPreview_Caption
source: {0} Preview
es: Vista previa de {0}
ko: {0} 미리 보기
pt_br: Visualização de {0}
ru: {0} — предварительный просмотр

# TransformPreview_ErrorMessage
source: There was an error transforming your file. See the error list for more details
es: Hubo un error al transformar el archivo. Consulte la lista de errores para más detalles
ko: 파일을 변환하는 중 오류가 발생했습니다. 자세한 내용은 오류 목록을 참조하세요.
pt_br: Houve um erro ao transformar seu arquivo. Consulte a lista de erros para obter mais detalhes
ru: Произошла ошибка при преобразовании файла. См. список ошибок для получения более подробной информации

# TransformPreview_LeftLabel
source: Original {0}
es: {0} original
ko: 원본 {0}
pt_br: {0} original
ru: Оригинальные {0}

# TransformPreview_RightLabel
source: Transformed {0} (by {1} )
es: {0} transformado (por {1} )
ko: {1}에 의해 변환된 {0}
pt_br: {0} transformado (por {1} )
ru: Преобразованный {0} (по {1})

# TransformPreview_ToolTip
source: {0} Preview
es: Vista previa de {0}
ko: {0} 미리 보기
pt_br: Visualização de {0}
ru: {0} — предварительный просмотр
